/*************************************************************************
	> File Name: 14.demo.c
	> Author: 
	> Mail: 
	> Created Time: Fri 22 Mar 2024 02:36:34 PM CST
 ************************************************************************/

#include<stdio.h>



int main() {
    int arr[] = {1, 2, 3, 4, 5, 6, 7};
    int *p = arr;
    for (int i = 0; i < 3; i++) {
        //(i + 5)[&p[1] - 2]
        //第一次转换(i + 5)[p + 1 - 2]
        //第二次转换*(i + 5 + p + 1 -2), 这里用到了[]运算符规则
        //最终结果p[i + 4];
        //所以下面代码等价于printf("%d\n", (i + 5)[&p[1] - 2]);
        printf("%d\n", (i + 5)[&p[1] - 2]);
        //所以最终打印的是p[4], p[5], p[6]的值;
    }
    return 0;
}
