/*************************************************************************
	> File Name: 10.ont_stmt.c
	> Author: 
	> Mail: 
	> Created Time: Fri 15 Mar 2024 05:23:55 PM CST
 ************************************************************************/

#include<stdio.h>



int main() {
    //1为真所以一定会执行if后面的代码段
    //{}中的代码就是一条语句，也就是复合语句
    if (1) {
        printf("hello\n");
        printf("ni hao\n");
    }
    //while后面控制一条语句也就是if语句
    //然后if后面控制复合语句
    //所以这里if语句会执行55次
    int n = 5;
    while (n--) if(1)  {
        printf("hello\n");
        printf("666\n");
    }
    //循环1后面的语句就是循环1和代码段2组成的复合语句
    //循环1开始后，先执行循环2，循环2开始执行然后执行代码段1
    //循环2结束后，执行代码段20
    //然后又返回到循环1,直到循环1结束
    for (int i = 1; i <= 3; i++) {//循环1
        for (int j = 1; j <= 3; j++) {//循环2
            printf("(%d, %d), ", i, j);//代码段1
        }
        //代码段2
        printf("\n");
    }
    return 0;
}
