/*************************************************************************
	> File Name: test2.c
	> Author: 
	> Mail: 
	> Created Time: Wed 13 Mar 2024 04:50:41 PM CST
 ************************************************************************/

#include<stdio.h>


int main() {
    int a, b;
    scanf("%d%d", &a, &b);
    //这里需要用到printf函数的返回值
    //printf返回值是输出了多少个字符
    //而这里printf 输出了4个字符 Y E S \n，所以返回值为4
    //那么就可以看为 a < b && 4, 而非0及真所以后半部分为真
    //a < b如果成立就会输出YES
    //不成立就不会输出
    //因为逻辑与如果前面的条件表达式不成立那么，他就不会再去执行后面的代码了
    a < b && printf("YES\n");
    //这里的逻辑和上面相同
    !(a < b) && printf("NO\n");
    return 0;
}
