/*************************************************************************
	> File Name: 6.test1.c
	> Author: 
	> Mail: 
	> Created Time: Sun 10 Mar 2024 04:36:57 PM CST
 ************************************************************************/

#include<stdio.h>


int main() {
    //创建str字符数组并初始化
    char str[100] = {0};
    //[]是字符匹配集，意思就是在[]中含有的内容将会读取，反之则不
    //^这个字符的意思是非,那么[^\n]的意思就是除\n这个字符以外的都读取
    //这里没有用到&,就先记住读取字符数组不用加&这个符号
    scanf("%[^\n]s", str);
    printf("str = %s\n", str);
    return 0;
}
